# Частина коду, створена студентом КН-32/2 Самковим Данилом Олександровичем:

# Текст
text = "Python — інтерпретована об'єктно-орієнтована мова програмування високого рівня із суворою динамічною типізацією. Розроблена в 1990 році Гвідо ван Россумом. Структури даних високого рівня разом із динамічною семантикою та динамічним зв'язуванням роблять її привабливою для швидкої розробки програм, а також як засіб поєднування наявних компонентів. Python підтримує модулі та пакети модулів, що сприяє модульності та повторному використанню коду. Інтерпретатор Python та стандартні бібліотеки доступні як у скомпільованій, так і у вихідній формі на всіх основних платформах. В мові програмування Python підтримується кілька парадигм програмування, зокрема: об'єктно-орієнтована, процедурна, аспектно-орієнтована та функціональна."

# 1. Перетворення тексту на верхній регістр
text_upper = text.upper()
print("Текст у верхньому регістрі:", text_upper)

# 2. Підрахування кількості слів у тексті
word_count = len(text.split())
print("Кількість слів у тексті:", word_count)

# 3. Заміна слова "Python" на "Java"
text_replaced = text.replace("Python", "Java")
print("Текст після заміни слова 'Python':", text_replaced)
